# Shell
cask "wezterm"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "tmux"

# Fonts (required for wezterm + powerlevel10k)
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"

# Editor
brew "neovim"
brew "tree-sitter-cli"

# CLI (referenced in .zshrc and tmux.conf)
brew "eza"
brew "zoxide"
brew "fzf"
brew "yazi"
brew "sesh"
brew "coreutils"
brew "git"

# Languages & Runtimes
brew "go"
brew "pyenv"
brew "pyenv-virtualenv"
brew "fnm"
brew "uv"

# Mobile / JS Development
tap "oven-sh/bun"
brew "oven-sh/bun/bun"
brew "watchman"

# Apps
cask "1password"
cask "orbstack"
cask "raycast"
cask "slack"
cask "tailscale-app"
cask "zen"

# Development
brew "awscli"
brew "azure-cli"
brew "libpq"
brew "gh"
brew "ripgrep"
brew "jq"
brew "terraform"
cask "gcloud-cli"

# Dev tunneling
cask "ngrok"
brew "cloudflared"

# Stripe
tap "stripe/stripe-cli"
brew "stripe/stripe-cli/stripe"

# Supabase
tap "supabase/tap"
brew "supabase/tap/supabase"
