# Shell
cask "wezterm"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "tmux"

# Fonts (required for wezterm + powerlevel10k)
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"

# Editor
brew "neovim"

# CLI (referenced in .zshrc)
brew "eza"
brew "zoxide"
brew "fzf"
brew "yazi"
brew "coreutils"
brew "git"

# Languages & Runtimes
brew "pyenv"
brew "pyenv-virtualenv"
brew "fnm"
brew "uv"

# Apps
cask "1password"
cask "orbstack"
cask "raycast"
cask "slack"
cask "tailscale"

# Development
brew "awscli"
brew "azure-cli"
brew "libpq"
brew "gh"
brew "ripgrep"
brew "lazygit"
brew "jq"

# Supabase
tap "supabase/tap"
brew "supabase/tap/supabase"
